Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Webcomic_7 Fates (KO>EN).tmx
Source language: ko
Languages: en

source: 환이잖아?
en: hwan, it’s you right?!

source: 그땐 정말… 죽는 줄 알았는데….
en: I really thought... I was going to die...

source: 호격
en: tiger dash

source: 크아아아아아
en: arghhh

source: 범들은 어디 있어?
en: where are the beom?

source: 문득 궁금했다.
en: a question crossed my mind.

source: 도건, 넌 왜 이렇게 표정이 안 좋은 게냐.
en: do-geon, why might you be expressing such anger?

source: 네 검을 봐라.
en: take a look at your sword.

source: 제하야!
en: zeha!

source: 그래, 도둑놈들!{j}다소 거친 방법을 써도 괜찮아.
en: yes! feel free to rough them up if you need to.{j}

source: ···살아 있는 사람이었군.
en: oh, he’s a living man...

source: 그래, 전부 저놈하고 엮일 때부터야.
en: yes... things took a turn for the worse ever since I met him.

source: 저 화살인가?
en: was it from that arrow?

source: 그렇게
en: instead...

source: 내일 중요한 날인데 컨디션 조절 좀 하지.
en: tomorrow’s our big day. you should’ve just stayed in.

source: 불과 석 달 전 네 실력으로는 스치지도 못했던 녀석들이야.
en: three months ago, you couldn’t even leave a scratch on their skins.

source: 뭐?
en: what?

source: 제가 도울 수 있는 일이라면 돕겠습니다.
en: I’ll help if I can.

source: ...나왔다
en: we made it...

source: 아, 아닙니다.
en: n-no, of course not.

source: 그로 인해 이살 그룹의 대표인 환웅은 ‘특별 포상법’으로 범을 사냥하기로 결단하고
en: this drove hwanwoong, the chairman of yisal group, to put a bounty on every beom’s head...

source: 그 사이에 하루를 구해.
en: take the chance to save haru.

source: 고오오
en: whoosh

source: 인질들도 다 구했으니 우리도 나가자.
en: now that we saved all the hostages, let’s get out of here.

source: 3화
en: episode 3

source: 내…내가 살아 있다니….
en: I-I can’t believe I’m still alive...

source: 저래 보여도 나쁜 녀석은 아니야.
en: it may be hard to believe now, but he’s a good guy.

source: 그 자의 이름은 '후포'.
en: and that was hupo.

source: 여기 정말 범들의 은거지 맞아?
en: are you sure this is the beom’s hiding place?

source: 진짜 사냥은 말이야…
en: let me show you how it’s really done.

source: 툭
en: bump

source: 콰아아아
en: whoosh

source: 죽는다···죽는다고···!
en: I’m dying... I’m going to die!

source: 우우우웅
en: whir

source: 무기 거래소
en: weapons exchange

source: 오합지졸로 보여도 방금 놈들은 호랑나비 중 일부에 지나지 않아.
en: you may think they’re nothing but a small bunch of thugs, but they’re just a few of the whole.

source: 최고야, 인간을 내 마음대로 할 수 있다니···!
en: it’s the best. I can do whatever I want with the humans!

source: ···우리 전생부터 범 사냥꾼이었던 거야?
en: are you saying that we were beom hunters in our past lives as well...?

source: 박물관 근처까지 당하다니···!
en: I can’t believe the museum was attacked!

source: 다소 거친 방법을 써도 괜찮아.
en: treat them roughly if you need to.

source: 널 이렇게 만든 놈한테…
en: I’ll make sure the ones who did this to you...

source: 너도 죽는 편이 낫겠구나.
en: I’d better kill you.

source: 그르릉...
en: growl

source: 전당포
en: Pawn Shop

source: 범들이 있는 곳이야.
en: ...where the beom are at.

source: 아니, 정확히는 곰족인 어미 사이에서 태어났다.
en: no, to be exact... your mother was from the bear tribe.

source: 상당히 얕잡혀 보였군.
en: you must’ve really underestimated me.

source: 후포라는 자의 계략에 빠져서 결계를 깨뜨렸단 말이지?
en: got tricked by a beom named hupo and broke the seal. did I get that right?

source: 괜찮느냐!
en: are you all right?!

source: 뭐야.{j}저 아저씨, 사기꾼이었어?
en: what? he’s a swindler?{j}

source: 네놈들,
en: you...

source: 오.
en: oh.

source: 킁...
en: sniff

source: 덜...
en: tremble

source: 제군들!
en: attention!

source: 먼저 배신한 놈들이 왜 그런 무모한 싸움을···.
en: just why would the ones who betrayed the others first wage such a reckless war...?

source: 맨 정신으로 범의 배 속에 있는 건 결코 사람이 할 짓이 아니었으니까.
en: being fully conscious while caged in a beom’s stomach wasn’t something one could bear with.

source: 너도・・・
en: so...

source: 문제의 'S' 씨라 표명.
en: They announced he is the one responsible for the gun attack.

source: 저런 놈들이 우리 호랑나비에 필요한 인재니까.
en: they’re the kind of talents we tiger butterfly need.

source: 더 이상 그때와 같은 일은 겪고 싶지 않아.
en: I never want to go through that torture again.

source: 하하···.
en: haha...

source: 내가 찾고 있는 놈이 좀처럼 안 나타나서 말이야.
en: you see, the beom I’m after just won’t show up.

source: 3개월 전에 비해 범의 개체 수가 너무 많아졌어···.
en: there are too many beom now compared to three months ago...

source: 하아···.
en: huff

source: 크린세탁
en: Clean Laundry

source: 그건 두고 가.
en: leave the head before you go.

source: 얘들아, 선생님들 뒤에 있어!
en: kids, stay behind your teachers!

source: 껄껄
en: haha

source: 네가
en: it’s because...

source: 투둑...
en: flop

source: 이···이게 뭡니까?
en: wh-what’s this?

source: 범 포획 포상금은 이대로 계속 진행해도 괜찮을까요?
en: do you plan to continue rewarding the beom hunters?

source: 난 이미 한 사람을 부축 중인데,
en: my hands are already full.

source: 자네는 수호자의 자격이 없어.
en: you don’t deserve to be a guardian.

source: 버・・・범들이・・・.
en: the beoms...

source: 이 범족의 수치가.
en: what a shame to the beom tribe.

source: 코앞이라더니, 왜 이렇게 안 와?
en: I thought they were just around the corner. what’s taking them so long?

source: 저릿···
en: throb

source: 정말 미안해···.
en: I’m so sorry...

source: 파팟
en: swish

source: 전기재료
en: electrical materials

source: 공등기획 ・ 하이브 / 네이버 웹툰
en: Joint Planning · HYBE & Naver Webtoon

source: 더 이상 볼 수 없게 됐어.
en: now I won’t be able to see her ever again.

source: 스걱
en: slash

source: 내가 오기 전에 먼저 범을 처치하고 있었어.
en: he was fighting the beom before I got here.

source: 음···?
en: hmm...?

source: 하루!
en: haru!

source: 하루···!
en: haru...!

source: 출구 EXIT B4
en: EXIT B4

source: 굶기고
en: ...deprived me...

source: 여긴 어디야!
en: where am I?!

source: 대신,
en: in return...

source: 두쿵
en: thump

source: 네, 주군.
en: yes, master.

source: 큭···!
en: argh...!

source: 처억
en: lift

source: 호랑나비 3팀 리더 김병진
en: tiger butterfly team 3 leader seongjin kim

source: 그거,
en: isn’t that the weapon...

source: 이미 늦었어.
en: too late.

source: 총이 아니니 더 귀한 거지.
en: that’s exactly why it's such a rarity.

source: 츠츠츠・・・
en: crackle

source: 너 때문에 결계가 깨진 건 변함없으니까.
en: after all, it doesn’t change the fact that you broke the seal.

source: 기긱
en: keke

source: 곰족의 배신을 잊은 거냐?
en: have you forgotten about how the gom tribe betrayed us?

source: 파앗
en: swish

source: 이런!{j}건물이 더 이상 버티지 못해!
en: shoot! the building’s not gonna hold any much longer!{j}

source: 그래, 백번 양보해서 네가 수호신이라고 치자.
en: fine, I’ll play along. let’s say you are what you claim, a guardian deity.

source: 공인중개사
en: Realtor

source: 복수는 간결하게.
en: take your revenge swiftly...

source: 마로 님!
en: maro!

source: 민철아, 달려!
en: mincheol, run!

source: 쿠오오오오
en: da dun

source: 저 피 때문인가?
en: is it because of that blood?

source: 그, 그게 무슨···.
en: wh-what are you talking about...?

source: 치안총감님 표정이 어두우시군요.
en: commissioner general, you seem to have something on your mind.

source: 쩍
en: crack

source: 혹시 여동생이야?
en: is she your sister?

source: 제길···!{j}숨이 제대로 안 쉬어져!
en: ack...! I can’t breathe properly!{j}

source: 네가 내 상처에 대해 어떻게 알아?
en: how do you know about the wound?

source: 그 파티, 나도 끼워줘.
en: count me in your hunting party.

source: 알겠습니다.{j}신시를 염려하시는 환웅 님 앞이니 말씀드리도록 하죠.
en: I’ll tell you since you care about the city as much as everyone else here.{j}

source: 다음 구역으로 간다.
en: let’s move on to the next district.

source: 내 동생들한테 참회할 시간은 주도록 하지.
en: I’ll spare you some time to apologize to my teammates.

source: 후우-
en: phew

source: 그러고 보니 세인이 들려주는 이 이야기···
en: this story cein’s telling us...

source: 피융
en: whizz

source: 생일 축하해.
en: happy birthday, bro.

source: 이대로면 전멸한다고!
en: we’ll all die at this rate!

source: 그런 게 아니야.
en: it’s not that.

source: 놈들의 후손은 희희낙락거리며 지낼 때,
en: while their descendants enjoyed themselves,

source: 가···가까이 온다!
en: h-he’s coming closer!

source: 진짜?
en: really?!

source: 환웅은 이 사건을 적극적으로 해결해 나갈 것이라고 밝혔으며, 정부도 환웅의 행보에 적극 동참할 것이라 밝혔습니다.
en: He pledged to actively take part in finding the solution, to which the government pledged full support.

source: 사람이 없으니 좋구나.
en: it’s nice here, with no one around.

source: ···결국 굶어 죽는 걸 선택한 건가.
en: guess he chose to starve to death after all...

source: 환웅 님은 뭐든 꿰뚫어 보시는군요.
en: you read me like a book, chairman.

source: 크하아아...
en: grrr

source: ···치안총감님 아니십니까.
en: commissioner general?

source: 그만 마시게!
en: control yourself!

source: 다른 녀석들은 자기가 언제 죽었는지도 모르게 죽었잖아?
en: others drew their last breath without even realizing it.

source: 크{j}크{j}크{j}크
en: snicker{j}

source: 너무 분하다・・・!
en: ...that I’m so weak!

source: 푸욱
en: stab

source: 촤르르륵
en: fwish

source: 어째서 평범한 사람처럼 약한 거지?
en: so why am I weak and slow, like other ordinary humans?

source: (속보)
en: (Breaking News)

source: 치지지지지직...
en: crackle

source: 그럼 이 한은 어떻게 풀면 되는 거냐고!
en: how else am I supposed to blow my steam off?!

source: 배가 성한 날이 없구나...
en: another wound to the stomach, I see...

source: 뭐야?{j}한 마리도 안 먹었네?
en: what the... you haven’t eaten a single one of them.

source: 오호···과연 환웅 님이시군요.
en: wow... chairman, you never disappoint me.

source: 통
en: clonk

source: 파츠츠츠츠
en: glare

source: 기억?!
en: where is this coming from?!

source: 어느 순간, 우는 방법 조차 잊어버렸다.
en: ...I eventually grew numb, stopped shedding a tear.

source: 똑똑
en: knock knock

source: 내가 척살검으로 범을 베겠습니다.
en: I'll slay the beom with the sword of death...

source: 맞아!
en: he’s right!

source: 시간은 사람을 변하게 한다.
en: the thing is, time changes people.

source: 어린이보호
en: SCHOOL BUS

source: 콰아앙
en: boom

source: 검이 변했어!
en: the sword transformed!

source: 화륵
en: crackle

source: 이제야 기억이 났나 보구나.
en: now you remember.

source: 쉬이이이...
en: swish

source: 불티 님!!!
en: bulti!!!

source: 후우···.
en: whew...

source: 경찰··· 아니, 군대를 불러줘!
en: call 911... no, somebody report this to the military!

source: 투둑
en: patter

source: 내가 그런 부탁을 해서 이런 일이···!
en: this happened because I asked them for help...!

source: 누구・・・?!
en: who’re you?

source: 공동기획
en: Joint Planning:

source: 으아아악
en: aaargh!

source: 제하, 집중하거라!
en: zeha, you must focus!

source: 제 17 화
en: Episode 17

source: 살아 있나···?
en: is he still breathing...?

source: 제법이네.
en: very impressive.

source: 두두두두
en: rumble

source: 하루!!!
en: haru!!!

source: 콰학
en: splat

source: 응?
en: huh?

source: 설마 우리 호랑나비 팀과 해볼 생각은 아니겠지?
en: you’re not seriously thinking of fighting us, the tiger butterfly, are you?

source: 제하 아니냐!
en: if it isn’t you, zeha!

source: 잘근
en: nibble

source: 총상 한번만 좀 보자.
en: let me take a look at your gunshot wound.

source: 그대로 굶어 죽을 셈이야?
en: do you plan on starving to death?

source: 팀 착호,
en: team chakho...

source: 목표물 발견.
en: target acquired.

source: 총을 쏠 때랑 느낌이 달라!
en: it feels totally different from firing a gun!

source: 뭐야, 웬 총성이야?!
en: where’s that gunshot from?!

source: 생각할 시간이 필요하다면 숫자 정돈 세주도록 하지.
en: I’ll count to ten if you need some time to think.

source: 에잉, 말이 길다!{j}어서 앞장서라!
en: pfft. save your breath and{j} lead the way, now!

source: 자재백화점
en: supplies store

source: 하여간, 돈이라면 눈이 뒤집혀서 저러는 것들이 있다니까.
en: some people really do just about anything for money.

source: 아직도 사냥 놀이나 하고 있을 줄이야.
en: well, well. looks like you haven’t given up on your little hunting game yet.

source: 뭐 하는 거야?
en: what are you doing?

source: 지금 알 수 있는 건・・・
en: right now, I know two things for sure.

source: ···범이라고 했던가?
en: they called it the beom...

source: ···미안해.
en: I’m sorry...

source: 뭐지, 이건・・・!
en: what... is this?!

source: 하아
en: huff

source: 저거다!
en: that’s it!

source: 쿠오오오...
en: da dun

source: 텁
en: grab

source: 같은 시각,
en: meanwhile,

source: [신시/뉴스] 의문의 살인 사건이 연이어 발생하는 신시에서 주민들이 두려움을 호소했다.{j}정부에서 수차례 수색을 나섰지만 해결할 수
en: [Sin-si/News] Citizens of Sin-si express fear over the series of mysterious murders in the city. The government conducted several searches, but nothing{j}

source: (주)내일익스프레스
en: Tomorrow Express Inc.

source: 배시시
en: grin

source: 그 노래 덕에 네 아비는 음력 1월 16일 끝났는데도,
en: thanks to that song, your father was able to stick around here even after january 16th,

source: 괴로워.{j}배가 고프다.{j}저 피 때문인가?
en: this is painful. and I’m hungry. is it because of that blood?{j}

source: 놈들이라면 우리가 처리했어.
en: we have already dealt with them.

source: 어?{j}누가 있네?
en: huh? someone’s here.{j}

source: 많이 컸구나.
en: look how much you’ve grown!

source: 기분 탓인가···?
en: am I just imagining things...?

source: 혹시 너도 거기・・・!
en: were you there-?!

source: 선물?
en: a gift?

source: 전부터 갖고 싶어 하던 거 맞지?
en: you’ve had your eyes on it for a while now, right?

source: 확인되는 대로 곧장 이동한다.
en: we’ll move on the double as soon as we have the number.

source: 신시에서 끔찍한 범죄가 일어나고 있는 건 아십니까?
en: are you aware of the heinous crimes taking place at sin-si right now?

source: 그런데・・・
en: but the thing is...

source: 츠츠츠츠
en: fizzle

source: 저 아저씨, 사기꾼이었어?
en: that guy is a swindler?

source: 저장고를 열어라.
en: open up the storage.

source: ···제하?
en: zeha...?

source: 분명 저 사람이 더 맛있을 겁니다!
en: I’m sure he’ll taste better than us!

source: 자책도 마찬가지고.
en: the same goes for blaming yourself.

source: 주안도 그렇고 범과 인연이 있는 건 놀랍지만···
en: I’m surprised both jooan and zeha has a close connection with the beom,

source: 우리를 방해한 대가는 클 거다.
en: you’ll pay for interrupting us today.

source: 너희들이냐?
en: was it you monsters...

source: 웅
en: bzzz

source: 돌아오고 있다・・・!
en: ...is returning!

source: 핑그르르르
en: twirl

source: 해가 저물고
en: my story went on through the night...

source: 끄아아아아아아!!
en: gahhhhh!!

source: 참전 용사···같은 거려나?
en: a war veteran, maybe?

source: 신시를 지킬 수 있게 앞으로 여러분도 저를 도와주셔야 합니다.
en: but please promise you’ll continue to help me keep sin-si safe.

source: 응,알겠어.
en: all right, noted.

source: 죽여라.
en: kill him.

source: 제가 개발 중인 이것이 도움이 될 수도 있겠군요.
en: ...what we’re currently developing at yisal may be of help.

source: 아, 아니야.{j}오히려 나 때문에···!
en: n-no! I should be the one apologizing...!{j}

source: 튼튼한 몸 하나는 자신 있어.
en: trust me, I’m very strong.

source: 인간···!
en: human...!

source: 제하야···!
en: zeha...!

source: …워.
en: ...you

source: 째릿
en: glare

source: 파츠츠츳
en: crackle

source: 기억들이・・・쏟아져 들어오고 있어・・・!
en: my memories... are coming back!

source: 제 3 화
en: episode 3

source: 너, 인간이 아니었구나?
en: you’re not a human, are you?

source: 콰지직
en: bzzt

source: 다 빼앗기고 어디에도 섞일 수 없었겠지.
en: your parents, even your memories about them.

source: 그놈들을 본 뒤로 동철 형님이 날 보는 시선이 예전 같지 않아.
en: dongcheol hasn’t treated me the same ever since he saw them on video.

source: 우리를 방해한 대가는 클 거다.{j}각오해 둬.
en: you’ll pay for getting in our way today. consider yourself warned.{j}

source: 무한으로
en: All You Can Eat

source: 살 생각 없으면 조용히 갈 길 가쇼.
en: if you’re not gonna buy anything, please see yourselves out.

source: 이런 좋은 자리에서 할 이야기는 아니었는데···.
en: my, my. I shouldn’t have brought it up when we’re here to have a good time...

source: 다른 애들은 늦네?
en: where’s haru and do-geon?

source: 죽여도 모자랄 판에 데려오라고?!
en: they deserve to die, but instead, he wants me to bring them alive and well?!

source: 아니, 진짜 저 녀석한테서 범 냄새가 난다고!
en: I’m serious! he smells like a beom.

source: 너 강해?
en: are you strong?

source: 크르르
en: grrr

source: 크으...
en: growl

source: 식사 시간이다.
en: time to eat.

source: 약속~
en: promise!

source: 저기, 잠시만요!
en: excuse me, stop your car!

source: 컥!
en: argh!

source: 아, 형.{j}방금 다녀왔어.
en: oh, maro. yeah, I just got back.{j}

source: 또 인간 가지고 장난치느라 늦겠지.
en: they’re probably fooling around with the humans again.

source: 곰족 때문에 4천 년 동안 얼마나 고통스러웠는데!
en: the gom tribe plunged us into 4,000 years of suffering!

source: 범들이 나오지 못하도록 인왕산 입구를 지키는 수호신이란다.
en: I am a deity who guards the entrance to inwang mountain, preventing the beoms from escaping.

source: 일렁
en: sway

source: 캬아아아
en: roar

source: 우욱・・・!
en: urgh!

source: 지금부터 백화점 지하에 있는 범 사냥에 나선다.
en: we’ll hunt the beom down in the basement.

source: 이럴 시간 없다.
en: we do not have time for this.

source: 슥...
en: lift

source: 쿠구구구구
en: da dun

source: 그 많은 범들을 혼자 쓰러뜨리다니 말이야.
en: taking down all those beom by yourself.

source: 하지만・・・
en: still...

source: 살려주세요!
en: somebody help!

source: 우인력
en: wu job bank

source: 제하
en: Zeha

source: 비명도 못 질러보고 죽다니 말이야.
en: I mean, they didn’t even get a chance to scream before they died.

source: 뭐야, 이 범 시체들!
en: look at all these beom on the floor!

source: 어째서 이런 일이···.
en: how in the world...?

source: 콰직
en: crash

source: 백화점 지하에서 사람들이 쏟아져 나오고 있답니다!
en: people are flooding out from the basement of the department store!

source: 맨날 대회야!
en: you always have a competition coming up!

source: 이런···!
en: oh, shoot!

source: 아무래도 시간이 좀 더 걸릴 거 같습니다.
en: but I am afraid it will take some more time.

source: ···어린애도 아니고.
en: stop acting like a child...

source: 저분들이 여긴 어떻게!
en: what are they doing here?!

source: 눈엣가시 같은 녀석들이다.
en: they’re a thorn in my side.

source: 도・・・도건 형님 사, 살려줘요・・・
en: do-dogeon, I don’t want to die.

source: 너희는 여기서 새로운 삶을 살게 될 거다.
en: you’ll be living a new life here...

source: 에잉, 말이 길다!
en: pff. save your breath and

source: 무리하지 마!
en: stay put. do not move!

source: 불티···!
en: bulti...!

source: 대롱
en: dangle

source: 왔나, 불티.
en: bulti, you’re here.

source: 후포, 그자가 내 부모님을・・・!
en: hupo killed my parents!

source: 쩌적
en: crack

source: 팀은 아니지만, 어쩌다 보니 뭉쳤달까?
en: we’re not a team per se, but we kinda ended up teaming up together.

source: 그래, 난 그날도 여기에 왔어.
en: I was here that day too.

source: 캬
en: ke

source: 어디 다쳤어?
en: are you hurt?

source: 와!
en: yay!

source: 끄아아아
en: arghhh

source: 이게 다 얼마야?
en: they’ll worth a fortune!

source: 아, 아까 범들이랑 싸울 때 내구도가 다 됐나 봐.
en: oh, it broke while fighting against the beom earlier.

source: 까칠해 보여도 사람은 상냥하네.
en: he looks rough, but he’s a nice guy.

source: 인사는 됐어.
en: no need to thank me.

source: 가현:
en: Gahyeon:

source: 밥 한 끼가 범 사냥까지 일이 커졌지만,
en: I never imagined having a meal would lead to a beom hunt...

source: 우리가 누군지 알고 이러는 거냐!
en: do you have any idea who we are?!

source: 벌써 범들은 사냥 준비를 끝마친 건가···?
en: have the beom finished their preparations for the hunt already?

source: 제하야!!!
en: zeha!!!

source: 빵
en: honk

source: 저 사람들은···?
en: aren’t they...?

source: 온다・・・!
en: here it comes...!

source: 드르렁~
en: snore

source: 촤아악
en: swish

source: 각오는 돼 있겠지?
en: ...better be ready for this.

source: 퓩퓨퓩
en: bam bam bam

source: 뭐 해?{j}서둘러, 이제 트럭이 도착했을 거라고.
en: what you doing? hurry along, the truck must’ve arrived by now.{j}

source: 흠, 흥정도 제대로 못 하는 초짜들 같은데···.
en: hmm... looks like they don’t have much experience with haggling.

source: 검을 쥐기 힘겹다.
en: the sword feels heavy in my hands.

source: 민철아!
en: mincheol!

source: 네게 아픔을 준 모든 원흉이
en: all these pains and scars,

source: 에이, 그래도 저한테는 항상 성진 형이 리더이신걸요.
en: regardless, you’ll always be a leader to me, seongjin.

source: 얌봄하붸 샌겨험 데법 냄철함 얘기도 하음굼.(얌전하게 생겨선 제법 냉철한 얘기도 하는군.)
en: yuor prity dunto earthen colhearted for your sof apphearance (you’re pretty down-to-earth and cold-hearted for your soft appearance).

source: 병원이다.
en: you’re in the hospital.

source: 나 혼자 싸울 때 구경만 하길래・・・.
en: because you just watched as I fought back there.

source: 소용없는 짓을 또.
en: there he goes again with his useless gimmick.

source: 마치···
en: it’s as if...

source: 크르르···.
en: grrr...

source: 죽여.
en: kill him.

source: 크흑···!
en: ugh...

source: 불티 님?
en: bulti?

source: 무기 거래소 신시 구시가지
en: weapons exchange old district of sin-si

source: 어머니는 결계를 지키는 곰족의 무녀였고.
en: and my mother was a shaman of the gom tribe protecting the gate.

source: 이게 도대체···.
en: how in the world...?

source: 크
en: ke

source: 이런 상황에서 이름을 밝히는 게 의미가 있나 싶지만···.
en: I don’t see the point of sharing names in this chaos...

source: 딱 거기까진 기억이 나는데・・・.
en: and that’s the last thing I remember...

source: 거기냐!
en: I hear you!

source: 검에서 기억이 흘러들어 온다!
en: memories of the sword are flowing into my head!

source: 괜찮아 제하야···?!
en: you okay, zeha?!

source: 쏘옥
en: slip

source: 역시 불티 님을 따르길 잘했다니까.
en: I knew I made the right call when I decided to follow bulti.

source: 호랑나비 3팀 미남이
en: tiger butterfly team 3 nami mi

source: 리모델링 전문
en: Renovation

source: 사, 사기라니!{j}듣는 사람들 오해하게···!
en: wh-what do you mean, rip you off?! people will get a wrong idea if you say it like that...!

source: 두두두
en: tatata

source: 파아아앗
en: beam

source: 인간이 아니었나?
en: I thought he was a human.

source: 이 친구도 일어났군.
en: this guy’s awake.

source: 그렇게 찾아 헤메던 부모님의 흔적은
en: once I got older,

source: 일신건재
en: Ilsin Materials

source: 신시
en: sin-si

source: 범 사냥꾼이 시민의 안전을 위협한다는 우려에 개인의 일탈이라는 반박도···
en: Some argue that beom hunters risk the safety of the citizens, while others defend it as an act of deviance from a single hunter...

source: 감사합니다!
en: thank you!

source: 형아~!
en: it’s me, your friend!

source: 탁
en: whack

source: 내 동생들을 이렇게 만든 게 너희들이냐.
en: was it you monsters who killed my dear friends?

source: 그 힘 덕분에 치명상을 입지 않고 불티와 싸울 수 있었어.
en: that’s how I was able to put up a fight against bulti without getting fatally injured.

source: 멈칫
en: halt

source: 날 잡아먹었던 범의 눈썹 같은데···.
en: I think it’s a brow of the beom that ate me...

source: 보육원 선생님은 아무말도 해주지 않았으니까.
en: the teachers dodged the question.

source: 한 달 전 음력 1월 16일
en: one month ago, january 16th on the lunar calendar

source: 그 사이에 나가셨나?
en: has he left already?

source: 곰족에게 당했던 걸 다 잊은 건가?
en: has he forgotten everything the gom tribe had done to us?

source: 더듬
en: touch

source: 주안은 살아 있나···.
en: I wonder if jooan’s alive...

source: 철컹
en: thunk

source: 짐승 살이 타는 냄새가 난다.
en: the smell of beast’s burning flesh is in the air.

source: 흑···!
en: ugh...!

source: 범도 함께 어울려 있는 세계야.
en: and even the beom were part of the community.

source: 하하, 그렇지!
en: haha, you’re right!

source: 도건!
en: do-geon!

source: 괜찮으면 너 이 녀석들 좀 데려와라.
en: if you are, can you bring these punks for me?

source: 거대한 발톱 자국,
en: scars of large claws.

source: 문이 닫히기 전,
en: come quickly,

source: 음력 1월 16일, 끔찍하게 훼손된 24구의 시체가 인왕산에서 발견되었다.
en: that day, on january 16th... police found 24 mutilated bodies on the mountain.

source: 벴다!
en: I really did it!

source: 제가 가지고 오겠습니다.
en: I’ll get it for you, sir.

source: 이해할 수 없군.
en: I don’t understand.

source: 네놈은 어떻게 살아 있지?
en: but how?

source: 쿠구구구...
en: rumble

source: 범의 배에서 탈출하게 되었지만 집에 와서도 공포와 불안에 떨어야만 했다.
en: despite making it out of a beom’s stomach, I suffered from constant pangs of fear and anxiety.

source: ···장갑차도 뚫는 탄인데
en: those bullets even penetrate armored vehicles...

source: 나는 내가 본 것을 믿기 어려웠다.
en: I could hardly believe what I saw.

source: 소리 지르지마・・・.
en: don’t scream in my ears...

source: 알겠냐?
en: I hope that taught you a lesson.

source: 정부에서 수차례 수색을 나섰지만 해결할 수
en: The government conducted several searches, but nothing

source: 사람을 곧장 잡아먹지 않고
en: ...I saw a group of beom...

source: POSU
en: HUNTER

source: 저건?!
en: how?!

source: 걱정마.
en: don’t worry.

source: 여기 무서워···.
en: I’m scared...

source: 자···후?
en: za...hu...?

source: 시신의 상태가 매우 참
en: The bodies were badly dama

source: 신시 내에서 뭔가 일어나고 있는 게 분명해.
en: something’s going on in sin-si, that’s for sure.

source: 슈아아
en: swish

source: 이런 물건을 어디서 찾을 수나 있을 거 같아?
en: where else do you think that you can find this beauty?

source: 도대체 뭘···.
en: what in the world is he-?

source: 제 13 화
en: Episode 13

source: 다른 걸 신경 쓸 때가 아니야!
en: now’s not the time to get distracted!

source: 0X0-XXXX-XXX
en: XXX-XXX-XXXX

source: 못 본 사이에 많이 컸구나.
en: look how much you’ve grown.

source: 중급 전사라고 해서 보내놨더니!
en: I sent you down here because you were a mid-grade beom...

source: 가까이 있는 사냥꾼을 찾습니다.
en: We’re looking for the nearest hunters.

source: 요즘 인간들이 말하는 사냥꾼인가 뭔가 하는 놈인가.
en: is he one of those beom hunters that the humans have been talking about?

source: 저 너머에 살던 범족이라는 것은 알고 있니?
en: that lived on the opposite side of this rock?

source: 눈 떠!{j}경수야!
en: get up! kyungsoo!{j}

source: 구해줘서 고마워.
en: thank you for saving me.

source: 그럼 백화점이 시끄럽지 조용하겠냐?
en: we’re in a department store. what’s so weird about hearing noises?

source: 너희에겐 7구역 정찰을 맡기마.
en: you two run a recon on district 7.

source: 후두둑...
en: whoosh

source: 멍청한 녀석···.
en: what a fool...

source: 지직...
en: bzzt

source: 끼릭
en: whish

source: 단지···
en: I just...

source: 상처가 울린다.
en: it’ll make my wounds hurt.

source: 중얼
en: murmur

source: 내가 무슨 말을 하고 싶은지 모르겠어?
en: don’t you understand what I’m getting at?

source: 제작
en: Production

source: 경수야!
en: kyungsoo!

source: 각오해 둬.
en: consider yourself warned.

source: 검뿐만이 아니야.
en: it’s not just the sword.

source: 제 12화
en: Episode 12

source: 뭐···뭐지?
en: wh-what the...?
